In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1205/014.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                   3                     4
0       NaN  NaN  NaN  Eaton (R)  112,232  Burgess (D)  102,860
1       NaN  NaN  NaN               52.2%                 47.8%
2    County   PR   TP                 NaN                   NaN
3   APPLING   19   19                 173                   162
4  ATKINSON    6    6                  66                    47

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2    3    4
3   APPLING  19  19  173  162
4  ATKINSON   6   6   66   47
5     BACON   7   7   74   75
6     BAKER   7   7   67   75
7   BALDWIN  16  16  244  617

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0    3    4
3   APPLING  173  162
4  ATKINSON   66   47
5     BACON   74   75
6     BAKER   67   75
7   BALDWIN  244  617

In [9]:
df.columns = ['county', 'Chuck Eaton', 'David L. Burgess']

In [10]:
df.tail(5)

        county Chuck Eaton David L. Burgess
157  WHITFIELD         324              178
158     WILCOX         118               80
159     WILKES         122              137
160  WILKINSON         106              266
161      WORTH         271              153

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county    candidate votes
0   APPLING  Chuck Eaton   173
1  ATKINSON  Chuck Eaton    66
2     BACON  Chuck Eaton    74
3     BAKER  Chuck Eaton    67
4   BALDWIN  Chuck Eaton   244

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [16]:
df['office'] = 'Public Service Commission'

In [17]:
df['district'] = '3'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Chuck Eaton', 'party'] = 'Republican'
df.loc[df['candidate'] == 'David L. Burgess', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Chuck Eaton       Republican    112232
David L. Burgess  Democrat      102860
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Public Service Commission,3,Republican,Chuck Eaton,173
1,ATKINSON,Public Service Commission,3,Republican,Chuck Eaton,66
2,BACON,Public Service Commission,3,Republican,Chuck Eaton,74
3,BAKER,Public Service Commission,3,Republican,Chuck Eaton,67
4,BALDWIN,Public Service Commission,3,Republican,Chuck Eaton,244

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')